lvx/base/Catalogs/бит_ЭлементыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЭлементыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СпособыКомпоновкиИсточниковДанных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеМногоязычное</Name>
					<Comment>Наименование (на различных языках)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Кодификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Comment>Вид группы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыГруппДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Настройки построителя</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигНесинхронный</Name>
					<Comment>Сдвиг несинхронный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДат</Name>
					<Comment>Сдвиг дат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатКон</Name>
					<Comment>Сдвиг дат кон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто1</Name>
					<Comment>Вид субконто1</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто2</Name>
					<Comment>Вид субконто2</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто3</Name>
					<Comment>Вид субконто3</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто4</Name>
					<Comment>Вид субконто4</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Comment>Представление отбора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Отключено</Name>
					<Comment>Отключено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборВОтчете</Name>
					<Comment>Хранилище отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетРасшифровка</Name>
					<Comment>Отчет расшифровка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьВОтчет</Name>
					<Comment>Не выводить в отчет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Comment>Вид информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Comment>Подключение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРасчетаДляФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаРасчета</Name>
							<Comment>Строка расчета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыПересчетаПоКурсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПересчетаПоКурсам</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыПересчетаПоКурсам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ЭлементыДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	ЗаполнитьКэшЗначений();
	
	// Восстановим настройки из хранилища
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЭлементОбъект = Параметры.ЗначениеКопирования.ПолучитьОбъект();
		Ссылка = Параметры.ЗначениеКопирования;
	Иначе	
		ЭлементОбъект = РеквизитФормыВЗначение("Объект");
		Ссылка = Объект.Ссылка;
	КонецЕсли; 
	
	СохраненнаяНастройка = Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(Ссылка);
	ЗаполнитьОтборПоНастройке(СохраненнаяНастройка);
	
	// Восстанавливаем таблицу ОтборВОтчете
    СохрОтборВОтчете = ЭлементОбъект.ПолучитьОтборВОтчете();
	
	Если ТипЗнч(СохрОтборВОтчете) = Тип("ТаблицаЗначений") 
		 Или ТипЗнч(СохрОтборВОтчете) = Тип("ДанныеФормыКоллекция")  Тогда
		
		Для каждого СтрокаТаблицы Из СохрОтборВОтчете Цикл
			НоваяСтрока = ОтборВОтчете.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла; 
	КонецЕсли; 
	
	// Для случая, когда источник данных - другой способ компновки необходимо 
	// инициализировать таблицу-источник для построителя.
	ИнициализироватьТаблицуИсточникПостроителя();		
	
	// Восстанавливаем настройки оформления
	НастройкиОформления = ЭлементОбъект.ПолучитьНастройкиОформления();
	
	Если ТипЗнч(НастройкиОформления) = Тип("Структура") Тогда
		// "Шрифт,ЦветТекста,ЦветФона,Формат,Отступ,ГоризонтальноеПоложение".
		Для каждого КлЗнч Из НастройкиОформления Цикл
			ЭтотОбъект[КлЗнч.Ключ] = КлЗнч.Значение;		
		КонецЦикла;
	Иначе
		// Настройки оформления по-умолчанию
		ЦветФона 				= ЦветаСтиля.ЦветОсобогоТекста;
		ГоризонтальноеПоложение = ПредопределенноеЗначение("ГоризонтальноеПоложение.Авто");
	КонецЕсли;     
	
	// Список доступных источников данных
	СписокИсточников = бит_МеханизмПолученияДанных.СформироватьСписокИсточники(Объект.Владелец);
	
	// Список выбора ресурсов 
	ЗаполнитьСписокРесурсовДляПересчетаПоКурсам();
	
    бит_МеханизмПолученияДанных.УстановитьОформлениеТаблицыОтбор(УсловноеОформление);	
	
	ТекущийРодитель = Объект.Родитель;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохраненнаяНастройка = Новый Структура;
	
	// Сохраняем отбор построителя
	ЭлементыОтбора = Новый Массив;
	Для каждого СтрокаОтбор Из ТаблицаОтбор  Цикл
		 
		 ЭлементОтбора = Новый Структура; 
		 ЭлементОтбора.Вставить("ПутьКДанным",   СтрокаОтбор.ПутьКДанным);
		 ЭлементОтбора.Вставить("Использование", СтрокаОтбор.Использование);
		 ЭлементОтбора.Вставить("ВидСравнения",  СтрокаОтбор.ВидСравнения);
		 ЭлементОтбора.Вставить("Значение", 	 СтрокаОтбор.Значение);
		 ЭлементОтбора.Вставить("ЗначениеС", 	 СтрокаОтбор.ЗначениеС);
		 ЭлементОтбора.Вставить("ЗначениеПо", 	 СтрокаОтбор.ЗначениеПо);
		 ЭлементОтбора.Вставить("ТипЗначения", 	 СтрокаОтбор.ТипЗначения);
		 ЭлементОтбора.Вставить("Представление", СтрокаОтбор.ПутьКДанным);

		 ЭлементыОтбора.Добавить(ЭлементОтбора);
	КонецЦикла; 
	
	СохраненнаяНастройка.Вставить("Отбор", ЭлементыОтбора);
	
	ТекущийОбъект.СохранитьНастройкиПостроителя(СохраненнаяНастройка);
	
	// Сохраняем ОтборВОтчете
	ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
	ТекущийОбъект.СохранитьОтборВОтчете(ТаблицаОтборов);
	
	// Сохраняем НастройкиОформления
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("Шрифт", 					Шрифт);
	НастройкиОформления.Вставить("ЦветФона", 				ЦветФона);
	НастройкиОформления.Вставить("ЦветТекста", 				ЦветТекста);
	НастройкиОформления.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложение);
	НастройкиОформления.Вставить("Формат", 					Формат);
	НастройкиОформления.Вставить("Отступ", 					Отступ);
	
	ТекущийОбъект.СохранитьНастройкиОформления(НастройкиОформления);
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", ТекущийОбъект.Ссылка.Пустая());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	РодительКорректен = ПроверитьИзменениеРодителя(Объект.Родитель);
	
	Если РодительКорректен Тогда
		ТекущийРодитель = Объект.Родитель;
	Иначе
		Объект.Родитель = ТекущийРодитель;
		ТекстСообщения = НСтр("ru = 'Элемент данных может быть подчинен только элементам вида ""Группировка"".'; 
							  |en = 'A data element can only be subordinate to elements of the ""Grouping""type.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.Родитель"); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГруппыПриИзменении(Элемент)	
	
	УстановитьВидимость();
	
	Если Объект.ВидГруппы = ПредопределенноеЗначение("Перечисление.бит_ВидыГруппДанных.ВыборкаДанных") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОтбор;
	ИначеЕсли Объект.ВидГруппы = ПредопределенноеЗначение("Перечисление.бит_ВидыГруппДанных.Формула") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаФормула;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеМногоязычноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РедактируемыйТекст", Объект.НаименованиеМногоязычное);
	
	Обработчик = Новый ОписаниеОповещения("НаименованиеМногоязычноеНачалоВыбораЗавершение", ЭтотОбъект);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("ОбщаяФорма.бит_ФормаРедактированияТекстаНаРазныхЯзыках",ПараметрыФормы,,,,, Обработчик, Режим);

КонецПроцедуры // НаименованиеМногоязычноеНачалоВыбора()

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура НаименованиеМногоязычноеНачалоВыбораЗавершение(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) = Тип("Строка") Тогда   	
		Объект.НаименованиеМногоязычное = Результат; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	ИзменениеИсточникаДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;	
	
	Для каждого Эл Из СписокИсточников Цикл
		ДанныеВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияПриИзменении(Элемент)
	
	ИзменениеНастройкиПодключения();
		
КонецПроцедуры

&НаКлиенте
Процедура ВидИнформационнойБазыПриИзменении(Элемент)
	
	ИзменениеВидаИнформационнойБазы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРасшифровкаПриИзменении(Элемент)
	
	ИзменениеОтчетРасшифровка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, "ВидСубконто1");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, "ВидСубконто2");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, "ВидСубконто3");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконто4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, "ВидСубконто4");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконтоОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	КонструктовФормата = Новый КонструкторФорматнойСтроки(Формат);
	КонструктовФормата.ДоступныеТипы = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(16, 3));
	
	Обработчик = Новый ОписаниеОповещения("ФорматНачалоВыбораЗавершение", ЭтотОбъект);
	КонструктовФормата.Показать(Обработчик);
	
КонецПроцедуры

// Обработчик завершения редактирования форматной строки.
//  См. Синтакс-помощник: КонструкторФорматнойСтроки.Показать().
// 
&НаКлиенте
Процедура ФорматНачалоВыбораЗавершение(Результат, Дополнительно) Экспорт
 
	Если Результат <> Неопределено Тогда
		Формат = Результат;		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	
	ОбновитьСтрокиРасчета(Объект.Формула);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОтбор

&НаКлиенте
Процедура ТаблицаОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			ТекущиеДанные.ПутьКДанным = "";
		Иначе
			ТекущиеДанные.Использование  = Истина;  
			ТекущиеДанные.ВидСравнения   = КэшЗначений.ВидСравненияРавно;
		КонецЕсли; 	

		ОткрытьФормуПолейПостроителя("ТаблицаОтбор", "ПутьКДанным", "Отбор");
	Иначе
		бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ТаблицаОтборЗначение, 
			ТекущиеДанные.ВидСравнения);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуПолейПостроителя("ТаблицаОтбор", "ПутьКДанным", "Отбор");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаОтбор.ТекущиеДанные;	
	СписокВидов = СписокВыбораВидаСравнения(ТекущаяСтрока.ПолучитьИдентификатор());
	
	Элемент.СписокВыбора.Очистить();

	Для Каждого Эл Из СписокВидов Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВидСравненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("ВидСравнения") Тогда
		
		ТекущаяСтрока = Элементы.ТаблицаОтбор.ТекущиеДанные;
	    ТекущаяСтрока.ВидСравнения = ВыбранноеЗначение;
		
	    ИзменениеВидаСравнения(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВидСравненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаОтбор.ТекущиеДанные;
	ИзменениеВидаСравнения(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_ЭлементыДанных") Тогда
		СкопироватьОтборЭлементаДанных(ВыбранноеЗначение, РежимКопированияНастроек);
	КонецЕсли; 
	
	РежимКопированияНастроек = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаОтбор.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЭтоПериодичность Тогда
	
		СтандартнаяОбработка = Ложь;
		
		СписокПериодичности = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодичности();
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаОтборЗначениеНачалоВыбораЗавершение", 
								ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокПериодичности);
	Иначе
		
		Если ТипЗнч(ТекущаяСтрока.ТипЗначения) = Тип("ОписаниеТипов") 
			И ТекущаяСтрока.ТипЗначения.Типы().Количество() > 1 
			И ТекущаяСтрока.Значение = Неопределено Тогда
			
			Элементы.ТаблицаОтборЗначение.ВыбиратьТип     = Истина;	
			Элементы.ТаблицаОтборЗначение.ОграничениеТипа = ТекущаяСтрока.ТипЗначения;
		Иначе	
			Элементы.ТаблицаОтборЗначение.ВыбиратьТип     = Ложь;	
			Элементы.ТаблицаОтборЗначение.ОграничениеТипа = Новый ОписаниеТипов;		
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения открытия формы списка значений.
//  См. Синтакс-помощник: ПоказатьВыборИзСписка().
// 
&НаКлиенте
Процедура ТаблицаОтборЗначениеНачалоВыбораЗавершение(ВыбЗначение, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбЗначение = Неопределено Тогда 		
		ДополнительныеПараметры.ТекущаяСтрока.Значение = ВыбЗначение.Значение;		
	КонецЕсли; 
	
	Если ТипЗнч(ДополнительныеПараметры.ТекущаяСтрока.ТипЗначения) = Тип("ОписаниеТипов") 
		 И ДополнительныеПараметры.ТекущаяСтрока.ТипЗначения.Типы().Количество() > 1 
		 И ДополнительныеПараметры.ТекущаяСтрока.Значение = Неопределено Тогда
		
		Элементы.ТаблицаОтборЗначение.ВыбиратьТип     = Истина;	
		Элементы.ТаблицаОтборЗначение.ОграничениеТипа = ДополнительныеПараметры.ТекущаяСтрока.ТипЗначения;
	Иначе	
		Элементы.ТаблицаОтборЗначение.ВыбиратьТип     = Ложь;	
        Элементы.ТаблицаОтборЗначение.ОграничениеТипа = Новый ОписаниеТипов;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаОтбор.ТекущиеДанные;
	
	Если ТипЗнч(ТекущаяСтрока.ТипЗначения) = Тип("ОписаниеТипов") 
		И ТекущаяСтрока.ТипЗначения.Типы().Количество() > 1 Тогда
		
		ТекущаяСтрока.Значение = Неопределено;
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете

&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;	
	
	Если ТекущиеДанные.Значение = Неопределено Тогда  		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;  		
	Иначе	                  		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Ложь; 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(КэшЗначений.МассивВидовСравнения); 
	
КонецПроцедуры
     
&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеВидСравненияПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеЗначениеПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры // ОтборВОтчетеЗначениеОчистка()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмерения

&НаКлиенте
Процедура ИзмеренияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		Если Копирование Тогда
		 	ТекущаяСтрока = Элементы.Измерения.ТекущиеДанные;
			ТекущаяСтрока.Имя = "";
		КонецЕсли; 	

		ОткрытьФормуПолейПостроителя("Измерения", "ПутьКДанным", "Измерение");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_ЭлементыДанных") Тогда
		 СкопироватьНастройкиРасшифровкиЭлементаДанных(ВыбранноеЗначение, РежимКопированияНастроек);
	КонецЕсли; 
	
	РежимКопированияНастроек = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	  СтандартнаяОбработка = Ложь;
	  ОткрытьФормуПолейПостроителя("Измерения", "ПутьКДанным", "Измерение");
	  
КонецПроцедуры
   
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьОтбор(Команда)
	
	РежимКопированияНастроек = "Заполнение";
	
	Если НЕ ТаблицаОтбор.Количество() = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьОтборЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Отбор будет очищен. Продолжить?'; 
							|en = 'Selection will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		ОткрытьФормуВыбораЭлементовДанных(Элементы.ТаблицаОтбор);		
	КонецЕсли; 
	
КонецПроцедуры // КомандаЗаполнитьОтбор()

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура КомандаЗаполнитьОтборЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуВыбораЭлементовДанных(Элементы.ТаблицаОтбор);		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьОтбор(Команда)
	
   РежимКопированияНастроек = "Добавление";	
   
   ОткрытьФормуВыбораЭлементовДанных(Элементы.ТаблицаОтбор);
   
КонецПроцедуры // КомандаДобавитьОтбор()

&НаКлиенте
Процедура КомандаЗаполнитьРасшифровку(Команда)
	
   РежимКопированияНастроек = "Заполнение";	
   
   Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьРасшифровкуЗавершение", ЭтотОбъект);
   ТекстВопроса = НСтр("ru='Настройка расшифровки будет очищена. Продолжить?';
   					   |en='Configuring decryption to be cleared. Continue?'");
   ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
   
КонецПроцедуры // КомандаЗаполнитьРасшифровку()

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура КомандаЗаполнитьРасшифровкуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ОткрытьФормуВыбораЭлементовДанных(Элементы.Измерения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьРасшифровку(Команда)
	
   РежимКопированияНастроек = "Добавление";	
   
   ОткрытьФормуВыбораЭлементовДанных(Элементы.Измерения);
   
КонецПроцедуры // КомандаДобавитьРасшифровку()

&НаКлиенте
Процедура КомандаЗаполнитьПересчетыПоКурсамИзСпособаКомпоновки(Команда)
	
	ЗаполнитьТаблицуПересчетаПоКурсам();
	
КонецПроцедуры // КомандаЗаполнитьПересчетыПоКурсамИзСпособаКомпоновки()

&НаКлиенте
Процедура ОткрытьПомощникВводаФормулы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка"  , Объект.Ссылка);
	ПараметрыФормы.Вставить("Владелец", Объект.Владелец);
	ПараметрыФормы.Вставить("Текст"   , Объект.Формула);
	
	Обработчик = Новый ОписаниеОповещения("ОткрытьПомощникВводаФормулыЗавершение", ЭтотОбъект);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("ОбщаяФорма.бит_ФормаВводаФормулы",ПараметрыФормы,ЭтотОбъект,,,, Обработчик, Режим);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОткрытьПомощникВводаФормулыЗавершение(СтруктураФормулы, Параметры) Экспорт
 
	Если ТипЗнч(СтруктураФормулы) = Тип("Структура") Тогда
		
		Объект.Формула = СтруктураФормулы.ТекстФормулы;
		
		// Таблица аргументов
		МассивСтрокРасчета = СтруктураФормулы.МассивСтрокРасчета;
		Объект.СтрокиРасчетаДляФормулы.Очистить();
		Для каждого ЭлементМассива Из МассивСтрокРасчета Цикл
			НоваяСтрока = Объект.СтрокиРасчетаДляФормулы.Добавить();
			НоваяСтрока.СтрокаРасчета = ЭлементМассива;
		КонецЦикла;   
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПолейПостроителя(ИмяТабЧасти, ИмяПоля, Режим)

	ТекущаяСтрока = Элементы[ИмяТабЧасти].ТекущиеДанные;
			
	ПараметрыФормы  = Новый Структура;
	ПараметрыФормы.Вставить("ВидИнформационнойБазы", Объект.ВидИнформационнойБазы);
	ПараметрыФормы.Вставить("НастройкаПодключения" , Объект.НастройкаПодключения);
	ПараметрыФормы.Вставить("Режим"            	   , Режим);
	ПараметрыФормы.Вставить("ВыводитьВложенные"    , Истина);
	ПараметрыФормы.Вставить("ТекстЗапроса"         , ТекущийТекстЗапроса);
	ПараметрыФормы.Вставить("АдресИсточникаПостроителя", АдресТаблицыИсточника);	
	
	Если НЕ ПустаяСтрока(ТекущаяСтрока[ИмяПоля]) Тогда
		
		ПараметрыФормы.Вставить("ТекПутьКДанным", ТекущаяСтрока[ИмяПоля]);
		
	КонецЕсли;
	
	Если ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		ПараметрыФормы.Вставить("ИсточникДанных", Объект.ИсточникДанных);
		
	КонецЕсли; 

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяПоля", ИмяПоля);
	ДополнительныеПараметры.Вставить("ИмяТабЧасти", ИмяТабЧасти);
	
	Обработчик = Новый ОписаниеОповещения("ОткрытьФормуПолейПостроителяЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("ОбщаяФорма.бит_мпд_ФормаВыбораСвойствПостроителя",ПараметрыФормы,,,,, Обработчик, Режим);
	
КонецПроцедуры // ОткрытьФормуПолейПостроителя()

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОткрытьФормуПолейПостроителяЗавершение(РезВыбора, ДополнительныеПараметры) Экспорт
   
	Если ТипЗнч(РезВыбора) = Тип("Структура") Тогда
		
		ДополнительныеПараметры.ТекущаяСтрока[ДополнительныеПараметры.ИмяПоля] = РезВыбора.ПутьКДанным;
		
		Если ДополнительныеПараметры.ИмяТабЧасти = "ТаблицаОтбор" Тогда
			
			ДополнительныеПараметры.ТекущаяСтрока.ТипЗначения  = РезВыбора.ТипЗначения;
			ДополнительныеПараметры.ТекущаяСтрока.Значение     = ДополнительныеПараметры.ТекущаяСтрока.ТипЗначения.ПривестиЗначение(ДополнительныеПараметры.ТекущаяСтрока.Значение);
			ДополнительныеПараметры.ТекущаяСтрока.ВидСравнения = ВидСравнения.Равно;
			
			Если ДополнительныеПараметры.ТекущаяСтрока.ПутьКДанным = "Периодичность" 
				И ТипЗнч(ДополнительныеПараметры.ТекущаяСтрока.Значение) = Тип("Число") Тогда
				
				ДополнительныеПараметры.ТекущаяСтрока.ЭтоПериодичность = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяРеквизита)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, Элемент, Объект, ИмяРеквизита,
		КэшЗначений.СписокТиповВидСубконто, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЭлементовДанных(ЭлементВладелец)
	
	Отбор = Новый Структура(); 
	Отбор.Вставить("Владелец", 		 Объект.Владелец);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ИсточникДанных", Объект.ИсточникДанных);
	ПараметрыФормы.Вставить("ВыборЭлемента", Истина);
	
	ОткрытьФорму("Справочник.бит_ЭлементыДанных.Форма.ФормаВыбора", ПараметрыФормы, ЭлементВладелец);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	ЭтоГруппировка = Объект.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Группировка;
	ЭтоВыборка     = Объект.ВидГруппы = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных;
	ЭтоФормула     = Объект.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Формула;
	ЭтоТекст       = Объект.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Текст;
	
	Элементы.ГруппаСтраницаОтбор.Видимость       		   = ЭтоВыборка;
	Элементы.ГруппаСтраницаФормула.Видимость     		   = ЭтоФормула;
	Элементы.ГруппаСтаницаСпособыРасчетаПоКурсам.Видимость = НЕ ЭтоТекст;
	
	// Видимость страницы субконто
	ПоказатьСубконто = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ИсточникДанных) 
		 И ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") 
		 И ЭтоВыборка Тогда
	
		ТекстЗапроса = ВРег(Объект.ИсточникДанных.ЗапросБД.ТекстЗапроса);
		Если Найти(ТекстЗапроса,ВРег("РегистрБухгалтерии")) Тогда
			 ПоказатьСубконто = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.ГруппаСтраницаСубконто.Видимость = ПоказатьСубконто;

	ЭтоВнешний   = ?(Объект.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза, Ложь, Истина);
	// Источник элемента данных - способ компоновки.
	ЭтоВложенный = ?(ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных"), Истина, Ложь);
	
	Элементы.ВидИнформационнойБазы.Доступность              = Не ЭтоВложенный;
	Элементы.НастройкаПодключения.Доступность               = ЭтоВнешний;
	Элементы.НастройкаПодключения.АвтоОтметкаНезаполненного = ЭтоВнешний;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	Если ЗначениеЗаполнено(Объект.ИсточникДанных) 
		 И ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		ТекущийТекстЗапроса = Объект.ИсточникДанных.ЗапросБД.ТекстЗапроса;
		
	КонецЕсли; 
	
	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ВидСравненияРавно"   , ВидСравнения.Равно);
	КэшЗначений.Вставить("МассивВидовСравнения", бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете("Массив"));
		
	// Заполним список типов для быстрого выбора составного.
	МассивТипов  = Объект.Ссылка.Метаданные().Реквизиты.ВидСубконто1.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	КэшЗначений.Вставить("СписокТиповВидСубконто", СписокВыбора);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРесурсовДляПересчетаПоКурсам()

	Для каждого КолонкаТб Из Объект.Владелец.КолонкиТаблицы Цикл
		
		Если КолонкаТб.ВидКолонки = "Ресурс" Тогда
		
			Элементы.СпособыПересчетаПоКурсамИмяКолонки.СписокВыбора.Добавить(КолонкаТб.ИмяКолонки);	
		
		КонецЕсли; 	
	
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСписокРесурсовДляПересчетаПоКурсам()

&НаСервере
Процедура ЗаполнитьТаблицуПересчетаПоКурсам()

	Объект.СпособыПересчетаПоКурсам.Очистить();
	
	Для каждого КолонкаТб Из Объект.Владелец.КолонкиТаблицы Цикл
		
		Если КолонкаТб.ВидКолонки = "Ресурс" Тогда
		
			НовСтрока = Объект.СпособыПересчетаПоКурсам.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, КолонкаТб);
		
		КонецЕсли; 	
	
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуПересчетаПоКурсам()

&НаСервере
Процедура ИзменениеВидаСравнения(Знач ИдСтроки)
	
	ТекущиеДанные = ТаблицаОтбор.НайтиПоИдентификатору(ИдСтроки);
	
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);
		
	бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ТаблицаОтборЗначение, 
		ТекущиеДанные.ВидСравнения);
		
КонецПроцедуры
 
&НаСервере
Функция СписокВыбораВидаСравнения(Знач ИдСтроки)
	
	ТекущаяСтрока = ТаблицаОтбор.НайтиПоИдентификатору(ИдСтроки);
	СписокВидов   = бит_МеханизмПолученияДанных.СписокВыбораВидаСравнения(ТекущаяСтрока);
	
    Возврат СписокВидов;
	
КонецФункции

&НаСервере
Процедура ИзменениеИсточникаДанных()
	
	Если ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		Объект.ВидИнформационнойБазы = Объект.ИсточникДанных.ВидИнформационнойБазы;
		Объект.НастройкаПодключения  = Объект.ИсточникДанных.НастройкаПодключения;
		
	Иначе	
		
		Объект.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
		
	КонецЕсли; 
	
	ИнициализироватьТаблицуИсточникПостроителя();	
	
	Если ЗначениеЗаполнено(Объект.ИсточникДанных) 
		 И ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		ТекущийТекстЗапроса = Объект.ИсточникДанных.ЗапросБД.ТекстЗапроса;
		
	Иначе
		
		ТекущийТекстЗапроса = "";
		
	КонецЕсли; 
	
	ИзменениеНастройкиПодключения();
	
	УстановитьВидимость();	
	
КонецПроцедуры // ИзменениеИсточникаДанных()

&НаСервереБезКонтекста
Функция ПроверитьИзменениеРодителя(Знач ОбъектРодитель)
	
	РодительКорректен = Истина;
	
	Если ЗначениеЗаполнено(ОбъектРодитель) Тогда
		ВидГруппы = бит_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРодитель, "ВидГруппы");
		Если ВидГруппы <> Перечисления.бит_ВидыГруппДанных.Группировка Тогда
			РодительКорректен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РодительКорректен;
	
КонецФункции

&НаСервере
Процедура ИзменениеНастройкиПодключения()
	
	Если ТекущаяНастройкаПодключения <> Объект.НастройкаПодключения Тогда
		
		ТекущаяНастройкаПодключения = Объект.НастройкаПодключения;
		
	КонецЕсли; 
	
	УстановитьВидимость();
	
КонецПроцедуры // ИзменениеНастройкиПодключения()

&НаСервере
Процедура ИзменениеВидаИнформационнойБазы()

	Если Не бит_ПолучениеДанныхВнешниеИсточникиСервер.ЭтоВнешняяБаза(Объект.ВидИнформационнойБазы) Тогда
		
		Объект.НастройкаПодключения = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПустаяСсылка();
		
	Иначе	
		
		Объект.НастройкаПодключения = Объект.ВидИнформационнойБазы.НастройкаПодключенияПоУмолчанию;
		
	КонецЕсли; 

	ИзменениеНастройкиПодключения();
	
КонецПроцедуры // ИзменениеВидаИнформационнойБазы()

&НаСервере
Процедура ИзменениеОтчетРасшифровка()
	
	Если ЗначениеЗаполнено(Объект.ОтчетРасшифровка) Тогда
		ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
		бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(Объект.ОтчетРасшифровка.СпособКомпоновки, ТаблицаОтборов);
		ЗначениеВДанныеФормы(ТаблицаОтборов, ОтборВОтчете);	
	Иначе	
		ОтборВОтчете.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиРасшифровкиЭлементаДанных(Знач ВыбранноеЗначение, Знач Режим)
	
	Если ВРег(Режим) = ВРег("Заполнение") Тогда		
		Объект.Измерения.Очистить();		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Для каждого СтрокаТаблицы Из ВыбранноеЗначение.Измерения Цикл			
			НоваяСтрока = Объект.Измерения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);			
		КонецЦикла;
		
	КонецЕсли; 
	
	Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьОтборЭлементаДанных(Знач ВыбранноеЗначение, Знач Режим)

	Если ВРег(Режим) = ВРег("Заполнение") Тогда
		ТаблицаОтбор.Очистить();
	КонецЕсли; 

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда		
		СохраненнаяНастройка = Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(ВыбранноеЗначение);
        ЗаполнитьОтборПоНастройке(СохраненнаяНастройка);		
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборПоНастройке(СохраненнаяНастройка)

	Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") Тогда
		
		// Восстанавливаем отбор построителя
		Если СохраненнаяНастройка.Свойство("Отбор") Тогда
			
			Для каждого ЭлементОтбора Из СохраненнаяНастройка.Отбор Цикл
				
				СтрокаОтбор = ТаблицаОтбор.Добавить();
				СтрокаОтбор.ПутьКДанным   = ЭлементОтбора.ПутьКДанным;
				СтрокаОтбор.Использование = ЭлементОтбора.Использование;
				СтрокаОтбор.ВидСравнения  = ЭлементОтбора.ВидСравнения;
				СтрокаОтбор.Значение      = ЭлементОтбора.Значение;
				СтрокаОтбор.ЗначениеС     = ЭлементОтбора.ЗначениеС;
				СтрокаОтбор.ЗначениеПо    = ЭлементОтбора.ЗначениеПо;
				СтрокаОтбор.ТипЗначения   = ЭлементОтбора.ТипЗначения;
				
				Если СтрокаОтбор.ПутьКДанным = "Периодичность" И ТипЗнч(СтрокаОтбор.Значение) = Тип("Число") Тогда
					СтрокаОтбор.ЭтоПериодичность = Истина;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьОтборПоСтруктуре()

// В случае, если источник данных - способ компоновки, процедура инициализирует таблицу, 
// которая является источником для построителя.  
// 
&НаСервере
Процедура ИнициализироватьТаблицуИсточникПостроителя()

	Если ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		
		МассивРесурсов  = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(Объект.ИсточникДанных,"Ресурс");				
		ТабВрем = бит_МеханизмПолученияДанных.ИнициализироватьТаблицуРезультат(Объект.ИсточникДанных, МассивРесурсов);
		АдресТаблицыИсточника = ПоместитьВоВременноеХранилище(ТабВрем, УникальныйИдентификатор);
		
	Иначе
		
		АдресТаблицыИсточника = "";
		
	КонецЕсли; 

КонецПроцедуры // ИнициализироватьТаблицуИсточникПостроителя()

// Процедура обновляет перечень элементов данных, используемых в формуле. 
//
// Параметры:
//  ТекущаяФормула - Строка.
//
&НаСервере
Процедура ОбновитьСтрокиРасчета(Знач ТекущаяФормула)
	
	АргументыФормулы = бит_СтрокиКлиентСервер.РазобратьФормулу(ТекущаяФормула);	
	Аргументы = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(АргументыФормулы);
	
	Объект.СтрокиРасчетаДляФормулы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", 		  Объект.Владелец);
	Запрос.УстановитьПараметр("МассивАргументов", Аргументы);
	Запрос.УстановитьПараметр("Ссылка", 		  Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка,
	|	бит_ЭлементыДанных.Код
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.Код В(&МассивАргументов)
	|	И бит_ЭлементыДанных.Владелец = &Владелец
	|	И бит_ЭлементыДанных.Ссылка <> &Ссылка";
				   
	Результат = Запрос.Выполнить();
	ТаблицаРезультат = Результат.Выгрузить();	
	Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл	
		НоваяСтрока = Объект.СтрокиРасчетаДляФормулы.Добавить();
		НоваяСтрока.СтрокаРасчета = СтрокаТаблицы.Ссылка;	
	КонецЦикла; 
	
	Если Аргументы.Количество() <> ТаблицаРезультат.Количество() Тогда
	
		Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
			Инд = Аргументы.Найти(СтрокаТаблицы.Код);
			Если Инд >= 0  Тогда			
				Аргументы.Удалить(Инд);			
			КонецЕсли;
		КонецЦикла; 

		Если Аргументы.Количество() > 0  Тогда

			ТекстСообщения = НСтр("ru = 'Не удалось найти элементы данных: %1'; en = 'Unable to find data elements: %1'");
			ТекстПояснения = НСтр("ru = 'Возможно, ошибка в формуле.'; en = 'There may be an error in the formula.'"); 

			Потерянные = Новый Массив; 
			Для каждого Аргумент Из Аргументы Цикл
				Потерянные.Добавить(Аргумент);
			КонецЦикла; 
			Потерянные = СтрСоединить(Потерянные, ",");			  
			ТекстСообщения = СтрШаблон(ТекстСообщения, Потерянные) + Символы.ПС + ТекстПояснения; 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			  
		КонецЕсли;
		  
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеВидСравненияПриИзмененииСервер(Знач Ид)
		
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	

КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеЗначениеПриИзмененииСервер(Знач Ид)
	
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

#КонецОбласти
